{
    "common": {
        "name": "tr-064",
        "version": "4.1.0",
        "news": {
            "4.1.0": {
                "en": "Fix crash case (Sentry IOBROKER-TR-064-14)\nadded tablesort to device search\nadded Fritzbox link to admin",
                "de": "Absturz behoben (Sentry IOBROKER-TR-064-14)\nTablesort zur Gerätesuche hinzugefügt\nFritzbox-Link zu admin hinzugefügt",
                "ru": "Исправить случай сбоя (Sentry IOBROKER-TR-064-14)\nдобавлена сортировка таблиц в поиск устройств\nдобавлена ссылка на Fritzbox в админку",
                "pt": "Corrigir caso de falha (Sentry IOBROKER-TR-064-14)\nadicionado tablesort para pesquisa de dispositivo\nadicionou o link do Fritzbox ao administrador",
                "nl": "Crashcase repareren (Sentry IOBROKER-TR-064-14)\ntafelsort toegevoegd aan apparaat zoeken\nFritzbox-link toegevoegd aan admin",
                "fr": "Correction d'un cas de crash (Sentry IOBROKER-TR-064-14)\nAjout de tablesort à la recherche de périphériques\nAjout du lien Fritzbox à l'administrateur",
                "it": "Risolto il crash case (Sentry IOBROKER-TR-064-14)\naggiunto tablesort alla ricerca del dispositivo\naggiunto il collegamento Fritzbox all'amministratore",
                "es": "Reparar caso de accidente (Sentry IOBROKER-TR-064-14)\norden de tabla agregado a la búsqueda de dispositivos\nSe agregó el enlace de Fritzbox al administrador",
                "pl": "Napraw przypadek awarii (Sentry IOBROKER-TR-064-14)\ndodano tableort do wyszukiwania urządzeń\ndodano link Fritzbox do administratora",
                "zh-cn": "修复崩溃的情况（Sentry IOBROKER-TR-064-14）\n在设备搜索中添加了tablesort\n将Fritzbox链接添加到管理员"
            },
            "4.0.13": {
                "en": "Crash prevented (Sentry IOBROKER-TR-064-10)",
                "de": "Absturz verhindert (Sentry IOBROKER-TR-064-10)",
                "ru": "Сбой предотвращен (Sentry IOBROKER-TR-064-10)",
                "pt": "Falha evitada (Sentry IOBROKER-TR-064-10)",
                "nl": "Crash voorkomen (Sentry IOBROKER-TR-064-10)",
                "fr": "Crash évité (Sentry IOBROKER-TR-064-10)",
                "it": "Blocco impedito (Sentry IOBROKER-TR-064-10)",
                "es": "Accidente prevenido (Sentry IOBROKER-TR-064-10)",
                "pl": "Zapobieganie awariom (Sentry IOBROKER-TR-064-10)",
                "zh-cn": "防止崩溃（Sentry IOBROKER-TR-064-10）"
            },
            "4.0.12": {
                "en": "Crash prevented (Sentry IOBROKER-TR-064-Y)",
                "de": "Absturz verhindert (Sentry IOBROKER-TR-064-Y)",
                "ru": "Сбой предотвращен (Sentry IOBROKER-TR-064-Y)",
                "pt": "Travamento evitado (Sentry IOBROKER-TR-064-Y)",
                "nl": "Crash voorkomen (Sentry IOBROKER-TR-064-Y)",
                "fr": "Crash évité (Sentry IOBROKER-TR-064-Y)",
                "it": "Crash prevenuto (Sentry IOBROKER-TR-064-Y)",
                "es": "Choque prevenido (Sentry IOBROKER-TR-064-Y)",
                "pl": "Zapobiegane awariom (Sentry IOBROKER-TR-064-Y)",
                "zh-cn": "防止崩溃（Sentry IOBROKER-TR-064-Y）"
            },
            "4.0.11": {
                "en": "Crash prevented (Sentry IOBROKER-TR-064-W)",
                "de": "Absturz verhindert (Sentry IOBROKER-TR-064-W)",
                "ru": "Предотвращение столкновения (Sentry IOBROKER-TR-064-W)",
                "pt": "Falha evitada (Sentinela IOBROKER-TR-064-W)",
                "nl": "Crash voorkomen (Sentry IOBROKER-TR-064-W)",
                "fr": "Crash évité (Sentry IOBROKER-TR-064-W)",
                "it": "Blocco impedito (Sentry IOBROKER-TR-064-W)",
                "es": "Accidente evitado (Sentry IOBROKER-TR-064-W)",
                "pl": "Zapobiegane awariom (Sentry IOBROKER-TR-064-W)",
                "zh-cn": "防止崩溃（Sentry IOBROKER-TR-064-W）"
            },
            "4.0.10": {
                "en": "Crash prevented (Sentry IOBROKER-TR-064-W)",
                "de": "Absturz verhindert (Sentry IOBROKER-TR-064-W)",
                "ru": "Предотвращение столкновения (Sentry IOBROKER-TR-064-W)",
                "pt": "Falha evitada (Sentinela IOBROKER-TR-064-W)",
                "nl": "Crash voorkomen (Sentry IOBROKER-TR-064-W)",
                "fr": "Crash évité (Sentry IOBROKER-TR-064-W)",
                "it": "Blocco impedito (Sentry IOBROKER-TR-064-W)",
                "es": "Accidente evitado (Sentry IOBROKER-TR-064-W)",
                "pl": "Zapobiegane awariom (Sentry IOBROKER-TR-064-W)",
                "zh-cn": "防止崩溃（Sentry IOBROKER-TR-064-W）"
            },
            "4.0.9": {
                "en": "handle cases correctly when no hosts are existing on device (Sentry IOBROKER-TR-064-R)",
                "de": "Behandeln Sie Fälle korrekt, wenn auf dem Gerät keine Hosts vorhanden sind (Sentry IOBROKER-TR-064-R).",
                "ru": "правильно обрабатывать случаи, когда на устройстве нет хостов (Sentry IOBROKER-TR-064-R)",
                "pt": "manipular casos corretamente quando não houver hosts no dispositivo (Sentry IOBROKER-TR-064-R)",
                "nl": "zaken correct afhandelen wanneer er geen hosts op het apparaat aanwezig zijn (Sentry IOBROKER-TR-064-R)",
                "fr": "gérer correctement les cas où aucun hôte n'existe sur l'appareil (Sentry IOBROKER-TR-064-R)",
                "it": "gestire i casi correttamente quando non esistono host sul dispositivo (Sentry IOBROKER-TR-064-R)",
                "es": "manejar casos correctamente cuando no hay hosts en el dispositivo (Sentry IOBROKER-TR-064-R)",
                "pl": "poprawnie obsługuje przypadki, gdy na urządzeniu nie ma hostów (Sentry IOBROKER-TR-064-R)",
                "zh-cn": "当设备上不存在主机时正确处理情况（Sentry IOBROKER-TR-064-R）"
            },
            "4.0.8": {
                "en": "Make sure states are only subscribed if initialization is done (Sentry IOBROKER-TR-064-J)",
                "de": "Stellen Sie sicher, dass Status nur abonniert werden, wenn die Initialisierung abgeschlossen ist (Sentry IOBROKER-TR-064-J).",
                "ru": "Убедитесь, что состояния подписаны только после инициализации (Sentry IOBROKER-TR-064-J)",
                "pt": "Verifique se os estados são inscritos apenas se a inicialização for concluída (Sentry IOBROKER-TR-064-J)",
                "nl": "Zorg ervoor dat staten alleen zijn geabonneerd als initialisatie is voltooid (Sentry IOBROKER-TR-064-J)",
                "fr": "Assurez-vous que les états ne sont souscrits que si l'initialisation est effectuée (Sentry IOBROKER-TR-064-J)",
                "it": "Assicurarsi che gli stati siano sottoscritti solo se l'inizializzazione è stata eseguita (Sentry IOBROKER-TR-064-J)",
                "es": "Asegúrese de que los estados solo estén suscritos si la inicialización se realiza (Sentry IOBROKER-TR-064-J)",
                "pl": "Upewnij się, że stany są subskrybowane tylko po zakończeniu inicjalizacji (Sentry IOBROKER-TR-064-J)",
                "zh-cn": "确保仅在完成初始化后才预订状态（Sentry IOBROKER-TR-064-J）"
            },
            "4.0.7": {
                "en": "Fix Admin UI to allow setting poll Interval correctly again",
                "de": "Korrigieren Sie die Admin-Benutzeroberfläche, damit das Abfrageintervall wieder korrekt eingestellt werden kann",
                "ru": "Исправлена ошибка, из-за которой пользовательский интерфейс администратора снова корректно устанавливал интервал опроса.",
                "pt": "Corrija a interface do usuário do administrador para permitir que o intervalo da pesquisa seja definido corretamente novamente",
                "nl": "Fix Admin UI om het instellen van het pollinterval weer correct toe te staan",
                "fr": "Correction de l'interface utilisateur d'administration pour permettre de définir correctement l'intervalle d'interrogation",
                "it": "Correggere l'interfaccia utente dell'amministratore per consentire di impostare correttamente nuovamente l'intervallo di polling",
                "es": "Se corrigió la interfaz de usuario del administrador para permitir configurar nuevamente el intervalo de sondeo correctamente",
                "pl": "Napraw interfejs administratora, aby znów poprawnie ustawiał interwał sondowania",
                "zh-cn": "修复管理界面，以允许再次正确设置轮询间隔"
            },
            "4.0.6": {
                "en": "Fix Admin UI to allow setting poll Interval correctly again",
                "de": "Korrigieren Sie die Admin-Benutzeroberfläche, damit das Abfrageintervall wieder korrekt eingestellt werden kann",
                "ru": "Исправлена ошибка, из-за которой пользовательский интерфейс администратора снова корректно устанавливал интервал опроса.",
                "pt": "Corrija a interface do usuário do administrador para permitir que o intervalo da pesquisa seja definido corretamente novamente",
                "nl": "Fix Admin UI om het instellen van het pollinterval weer correct toe te staan",
                "fr": "Correction de l'interface utilisateur d'administration pour permettre de définir correctement l'intervalle d'interrogation",
                "it": "Correggere l'interfaccia utente dell'amministratore per consentire di impostare correttamente nuovamente l'intervallo di polling",
                "es": "Se corrigió la interfaz de usuario del administrador para permitir configurar nuevamente el intervalo de sondeo correctamente",
                "pl": "Napraw interfejs administratora, aby znów poprawnie ustawiał interwał sondowania",
                "zh-cn": "修复管理界面，以允许再次正确设置轮询间隔"
            },
            "4.0.5": {
                "en": "Fix Admin UI to allow setting poll Interval correctly again",
                "de": "Korrigieren Sie die Admin-Benutzeroberfläche, damit das Abfrageintervall wieder korrekt eingestellt werden kann",
                "ru": "Исправлена ошибка, из-за которой пользовательский интерфейс администратора снова корректно устанавливал интервал опроса.",
                "pt": "Corrija a interface do usuário do administrador para permitir que o intervalo da pesquisa seja definido corretamente novamente",
                "nl": "Fix Admin UI om het instellen van het pollinterval weer correct toe te staan",
                "fr": "Correction de l'interface utilisateur d'administration pour permettre de définir correctement l'intervalle d'interrogation",
                "it": "Correggere l'interfaccia utente dell'amministratore per consentire di impostare correttamente nuovamente l'intervallo di polling",
                "es": "Se corrigió la interfaz de usuario del administrador para permitir configurar nuevamente el intervalo de sondeo correctamente",
                "pl": "Napraw interfejs administratora, aby znów poprawnie ustawiał interwał sondowania",
                "zh-cn": "修复管理界面，以允许再次正确设置轮询间隔"
            },
            "4.0.4": {
                "en": "Make sure adapter do not crash of no calls were returned (Sentry IOBROKER-TR-064-D)\nMake sure adapter do not crash when invalid parameter are provided (Sentry IOBROKER-TR-064-B)\nhttps is not supported right now (Sentry IOBROKER-TR-064-E)",
                "de": "Stellen Sie sicher, dass der Adapter nicht abstürzt und keine Anrufe zurückgegeben wurden (Sentry IOBROKER-TR-064-D).\nStellen Sie sicher, dass der Adapter nicht abstürzt, wenn ungültige Parameter angegeben werden (Sentry IOBROKER-TR-064-B).\nhttps wird derzeit nicht unterstützt (Sentry IOBROKER-TR-064-E)",
                "ru": "Убедитесь, что адаптер не дает сбоя, если не было возвращено ни одного вызова (Sentry IOBROKER-TR-064-D)\nУбедитесь, что адаптер не дает сбоя, если указан неверный параметр (Sentry IOBROKER-TR-064-B)\nhttps не поддерживается сейчас (Sentry IOBROKER-TR-064-E)",
                "pt": "Verifique se o adaptador não trava ou se nenhuma chamada foi retornada (Sentry IOBROKER-TR-064-D)\nVerifique se o adaptador não falha quando são fornecidos parâmetros inválidos (Sentry IOBROKER-TR-064-B)\nhttps não é suportado no momento (Sentry IOBROKER-TR-064-E)",
                "nl": "Zorg ervoor dat de adapter niet crasht of dat er geen oproepen zijn geretourneerd (Sentry IOBROKER-TR-064-D)\nZorg ervoor dat de adapter niet crasht wanneer er een ongeldige parameter wordt opgegeven (Sentry IOBROKER-TR-064-B)\nhttps wordt momenteel niet ondersteund (Sentry IOBROKER-TR-064-E)",
                "fr": "Assurez-vous que l'adaptateur ne plante pas car aucun appel n'a été renvoyé (Sentry IOBROKER-TR-064-D)\nAssurez-vous que l'adaptateur ne plante pas lorsque des paramètres non valides sont fournis (Sentry IOBROKER-TR-064-B)\nhttps n'est pas pris en charge pour le moment (Sentry IOBROKER-TR-064-E)",
                "it": "Assicurarsi che l'adattatore non si blocchi in caso di nessuna chiamata restituita (Sentry IOBROKER-TR-064-D)\nAssicurarsi che l'adattatore non si arresti in modo anomalo quando vengono forniti parametri non validi (Sentry IOBROKER-TR-064-B)\nhttps non è attualmente supportato (Sentry IOBROKER-TR-064-E)",
                "es": "Asegúrese de que el adaptador no se bloquee porque no se devolvieron llamadas (Sentry IOBROKER-TR-064-D)\nAsegúrese de que el adaptador no se bloquee cuando se proporcionan parámetros no válidos (Sentry IOBROKER-TR-064-B)\nhttps no es compatible en este momento (Sentry IOBROKER-TR-064-E)",
                "pl": "Upewnij się, że adapter nie ulega awarii, ponieważ żadne połączenia nie zostały zwrócone (Sentry IOBROKER-TR-064-D)\nUpewnij się, że adapter nie ulega awarii, gdy podano niepoprawny parametr (Sentry IOBROKER-TR-064-B)\nObecnie protokół https nie jest obsługiwany (Sentry IOBROKER-TR-064-E)",
                "zh-cn": "确保适配器不崩溃，没有返回任何呼叫（Sentry IOBROKER-TR-064-D）\n确保在提供无效参数时适配器不会崩溃（Sentry IOBROKER-TR-064-B）\n目前不支持https（Sentry IOBROKER-TR-064-E）"
            },
            "4.0.3": {
                "en": "Make sure adapter no not crash of no calls were returned (Sentry IOBROKER-TR-064-7)\nMake sure adapter do not crash when providing a non string to \"ring\" state (Sentry IOBROKER-TR-064-8)",
                "de": "Stellen Sie sicher, dass der Adapter kein Absturz oder keine Anrufe zurückgegeben wurden (Sentry IOBROKER-TR-064-7).\nStellen Sie sicher, dass der Adapter nicht abstürzt, wenn eine Nicht-Zeichenfolge in den Status \"Klingeln\" versetzt wird (Sentry IOBROKER-TR-064-8).",
                "ru": "Убедитесь, что адаптер не сбой, не было возвращено ни одного вызова (Sentry IOBROKER-TR-064-7)\nУбедитесь, что адаптер не дает сбоя при переводе нестрокового в состояние «кольцо» (Sentry IOBROKER-TR-064-8)",
                "pt": "Certifique-se de que o adaptador não não falhe, pois nenhuma chamada foi retornada (Sentry IOBROKER-TR-064-7)\nCertifique-se de que o adaptador não trava ao fornecer um estado não string para \"tocar\" (Sentry IOBROKER-TR-064-8)",
                "nl": "Zorg ervoor dat de adapter niet niet crasht of dat er geen oproepen zijn geretourneerd (Sentry IOBROKER-TR-064-7)\nZorg ervoor dat de adapter niet crasht bij het leveren van een niet-tekenreeks om te \"bellen\" (Sentry IOBROKER-TR-064-8)",
                "fr": "Assurez-vous que l'adaptateur ne se bloque pas ou qu'aucun appel n'a été renvoyé (Sentry IOBROKER-TR-064-7)\nAssurez-vous que l'adaptateur ne se bloque pas lors de la fourniture d'une chaîne non à l'état de \"sonnerie\" (Sentry IOBROKER-TR-064-8)",
                "it": "Assicurarsi che non sia stato restituito l'adattatore no crash di nessuna chiamata (Sentry IOBROKER-TR-064-7)\nAssicurarsi che l'adattatore non si arresti in modo anomalo quando si fornisce uno stato \"stringa\" senza stringa (Sentry IOBROKER-TR-064-8)",
                "es": "Asegúrese de que el adaptador no se bloquee o que no se hayan devuelto llamadas (Sentry IOBROKER-TR-064-7)\nAsegúrese de que el adaptador no se bloquee al proporcionar una cadena que no esté en estado de \"anillo\" (Sentry IOBROKER-TR-064-8)",
                "pl": "Upewnij się, że adapter nie zawiesił się i nie zostały zwrócone żadne połączenia (Sentry IOBROKER-TR-064-7)\nUpewnij się, że adapter nie ulega awarii, gdy podajesz łańcuch „non” do stanu „ring” (Sentry IOBROKER-TR-064-8)",
                "zh-cn": "确保适配器没有不崩溃，没有返回任何呼叫（Sentry IOBROKER-TR-064-7）\n确保提供非字符串“ ring”状态时适配器不会崩溃（Sentry IOBROKER-TR-064-8）"
            },
            "4.0.0": {
                "en": "BREAKING CHANGE: Password is now stored encrypted. Please re-enter the password in admin!",
                "de": "BREAKING CHANGE: Das Passwort wird jetzt verschlüsselt gespeichert. Bitte geben Sie das Passwort in admin erneut ein!",
                "ru": "BREAKING CHANGE: пароль теперь хранится в зашифрованном виде. Пожалуйста, введите пароль еще раз в админке!",
                "pt": "BREAKING CHANGE: A senha agora está armazenada criptografada. Por favor, digite novamente a senha em admin!",
                "nl": "BREAKING CHANGE: Wachtwoord wordt nu versleuteld opgeslagen. Voer het wachtwoord opnieuw in in admin!",
                "fr": "CHANGEMENT DE RUPTURE: Le mot de passe est maintenant stocké crypté. Veuillez ressaisir le mot de passe dans admin!",
                "it": "MODIFICA DI ROTTURA: la password è ora memorizzata crittografata. Inserisci nuovamente la password in admin!",
                "es": "CAMBIO DE ROMPER: La contraseña ahora se almacena encriptada. ¡Vuelva a ingresar la contraseña en admin!",
                "pl": "ZŁAMANIE ZMIANY: Hasło jest teraz przechowywane w postaci zaszyfrowanej. Proszę ponownie wprowadzić hasło w adminie!",
                "zh-cn": "BREAKING CHANGE：密码现在已加密存储。请在admin中重新输入密码！"
            },
            "3.1.4": {
                "en": "Configuration dialog was improved\nSoef library was removed",
                "de": "Konfigurationsdialog wurde verbessert\nSoef Bibliothek wurde entfernt",
                "ru": "Диалог конфигурации был улучшен\nSoef библиотека была удалена",
                "pt": "O diálogo de configuração foi aprimorado\nA biblioteca Soef foi removida",
                "nl": "Configuratiedialoog is verbeterd\nSoef-bibliotheek werd verwijderd",
                "fr": "La boîte de dialogue de configuration a été améliorée\nLa bibliothèque Soef a été supprimée",
                "it": "La finestra di configurazione è stata migliorata\nLa libreria Soef è stata rimossa",
                "es": "Se mejoró el diálogo de configuración\nSe eliminó la biblioteca Soef",
                "pl": "Okno konfiguracji zostało ulepszone\nBiblioteka Soef została usunięta",
                "zh-cn": "配置对话框进行了改进\nSoef库已删除"
            },
            "3.0.1": {
                "en": "REQUIRES js-controller 2.x!! Switch back to tr-064 as name and fix a lot of bugs and issues",
                "de": "ERFORDERT js-controller 2.x !! Wechseln Sie zurück zu tr-064 als Name und beheben Sie viele Fehler und Probleme",
                "ru": "ТРЕБУЕТСЯ js-контроллер 2.x !! Вернитесь к названию tr-064 и исправьте множество ошибок и проблем.",
                "pt": "EXIGE js-controller 2.x !! Volte para tr-064 como nome e corrija muitos bugs e problemas",
                "nl": "VEREIST js-controller 2.x !! Schakel terug naar tr-064 als naam en los veel bugs en problemen op",
                "fr": "REQUIERT js-controller 2.x !! Revenez au tr-064 comme nom et corrigez de nombreux bugs et problèmes",
                "it": "RICHIEDE js-controller 2.x !! Torna a tr-064 come nome e correggi molti bug e problemi",
                "es": "REQUIERE js-controller 2.x !! Vuelva al tr-064 como nombre y corrija muchos errores y problemas",
                "pl": "WYMAGA js-kontrolera 2.x !! Wróć z powrotem do tr-064 jako nazwa i napraw wiele błędów i problemów",
                "zh-cn": "需要js-controller 2.x !!切换回tr-064作为名称，并修复许多错误和问题"
            },
            "2.0.3": {
                "en": "fix delete last device from list",
                "de": "behebt das Löschen des letzten Geräts aus der Liste",
                "ru": "исправить удаление последнего устройства из списка",
                "pt": "corrigir excluir o último dispositivo da lista",
                "nl": "repareer laatste apparaat uit lijst verwijderen",
                "fr": "correction supprimer le dernier appareil de la liste",
                "it": "correggi elimina l'ultimo dispositivo dall'elenco",
                "es": "corregir eliminar el último dispositivo de la lista",
                "pl": "napraw usuń ostatnie urządzenie z listy",
                "zh-cn": "修复从列表中删除最后一个设备"
            },
            "2.0.2": {
                "en": "we no longer use adapter.objects",
                "de": "Wir verwenden keine adapter.objects mehr",
                "ru": "мы больше не используем адаптер.объекты",
                "pt": "não usamos mais adapter.objects",
                "nl": "we gebruiken niet langer adapter.objects",
                "fr": "nous n'utilisons plus adapter.objects",
                "it": "non usiamo più adapter.objects",
                "es": "ya no usamos adaptador.objetos",
                "pl": "nie używamy już adapter.objects",
                "zh-cn": "我们不再使用adapter.objects"
            },
            "1.1.0": {
                "en": "added Admin v3 support",
                "de": "Unterstützung für Admin v3 hinzugefügt",
                "ru": "добавлена поддержка Admin v3",
                "pt": "suporte Admin v3 adicionado",
                "nl": "ondersteuning voor Admin v3 toegevoegd",
                "fr": "ajout du support Admin v3",
                "it": "aggiunto supporto Admin v3",
                "es": "Soporte agregado de Admin v3",
                "pl": "dodano obsługę Admin v3",
                "zh-cn": "添加了Admin v3支持"
            },
            "1.0.1": {
                "en": "first version for the community",
                "de": "erste Version für die Community",
                "ru": "первая версия для сообщества",
                "pt": "primeira versão para a comunidade",
                "nl": "eerste versie voor de gemeenschap",
                "fr": "première version pour la communauté",
                "it": "prima versione per la comunità",
                "es": "Primera versión para la comunidad.",
                "pl": "pierwsza wersja dla społeczności",
                "zh-cn": "社区的第一个版本"
            }
        },
        "title": "TR-064",
        "titleLang": {
            "en": "TR-064",
            "de": "TR-064",
            "ru": "TR-064",
            "pt": "TR-064",
            "nl": "TR-064",
            "fr": "TR-064",
            "it": "TR-064",
            "es": "TR-064",
            "pl": "TR-064",
            "zh-cn": "TR-064"
        },
        "desc": {
            "en": "TR-064 is a protocol developed by the DSL Forum to allow DSL Internet access devices from the local area network configure. It is based on the Universal Plug and Play (UPnP) standard, which is generally used for manufacturer-independent control of devices in IP-based networks.",
            "de": "TR-064 ist ein Protokoll entwickelt, durch das DSL-Forum zu ermöglichen, DSL-Internet-Zugang-Geräten aus dem lokalen Netzwerk konfigurieren. Es basiert auf dem Universal Plug and Play (UPnP) - standard, das ist in der Regel für die Hersteller-unabhängige Steuerung von Geräten in IP-basierten Netzwerken.",
            "ru": "ТР-064-это протокол, разработанный форума DSL, чтобы разрешить устройствам беспроводной доступ в Интернет из локальной сети настроить. Она основана на универсальный подключи и играй стандарт (UPnP), что, как правило, используется производителем для независимого управления устройствами в IP-сетях.",
            "pt": "TR-064 é um protocolo desenvolvido por DSL Forum para permitir o acesso à Internet DSL dispositivos de rede de área local de configurar. Ele é baseado no Plug and Play Universal (UPnP) padrão, que geralmente é usado para o fabricante, independente de controlo de dispositivos em redes baseadas em IP.",
            "nl": "TR-064 is een protocol ontwikkeld door het DSL Forum voor het toestaan van DSL Internet access apparaten in het lokale netwerk configureren. Het is gebaseerd op de Universele Plug en Play (UPnP) - standaard, die wordt over het algemeen gebruikt voor fabrikant-onafhankelijke controle van de apparaten in IP-gebaseerde netwerken.",
            "fr": "TR-064 est un protocole développé par le DSL Forum pour permettre un accès Internet DSL les périphériques du réseau local configurer. Il est basé sur l'Universal Plug and Play (UPnP), qui est généralement utilisé pour le fabricant indépendant de contrôle des périphériques dans les réseaux IP.",
            "it": "TR-064 è un protocollo sviluppato da DSL Forum per consentire l'accesso a Internet adsl dispositivi dalla rete locale configurare. Esso è basato su Universal Plug and Play (UPnP) standard, che viene generalmente utilizzato per produttore indipendente di controllo dei dispositivi nelle reti basate su IP.",
            "es": "TR-064 es un protocolo desarrollado por el DSL Forum para permitir el acceso a Internet DSL de los dispositivos de la red de área local configurar. Se basa en el Universal Plug and Play (UPnP) estándar, que se utiliza generalmente para el fabricante independiente de control de dispositivos en redes basadas en IP.",
            "pl": "TR-064-jest to protokół opracowany przez forum DSL, aby zezwolić urządzeniom bezprzewodowy dostęp do Internetu z sieci lokalnej dostosować. Opiera się ona na universal plug and play standard (UPnP), co jest zwykle stosowany przez producenta do niezależnego sterowania urządzeniami w sieciach IP.",
            "zh-cn": "TR-064是协议制定的DSL论坛，以允许DSL互联网接入设备从该地区的网络配置。 它基于普遍即插即用(即用)的标准，该标准是通常用于制造商的独立控制的设备在基于IP网络。"
        },
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "keywords": [
            "tr-064",
            "fritz.box",
            "fritzbox",
            "avm"
        ],
        "mode": "daemon",
        "icon": "tr-064.png",
        "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.tr-064/master/admin/tr-064.png",
        "readme": "https://github.com/iobroker-community-adapters/ioBroker.tr-064/blob/master/README.md",
        "localLink": "http://%iporhost%",
        "loglevel": "info",
        "type": "infrastructure",
        "enabled": true,
        "messagebox": true,
        "materialize": true,
        "compact": true,
        "main": "main.js",
        "authors": [
            {
                "name": "soef",
                "email": "soef@gmx.net"
            }
        ],
        "dependencies": [
            {
                "js-controller": ">=2.0.0"
            }
        ],
        "connectionType": "local",
        "dataSource": "push",
        "plugins": {
            "sentry": {
                "dsn": "https://5423236b998b415bb9118690986763ea@sentry.iobroker.net/13"
            }
        }
    },
    "encryptedNative": [
        "password"
    ],
    "protectedNative": [
        "password"
    ],
    "native": {
        "iporhost": "fritz.box",
        "user": "",
        "password": "",
        "pollingInterval": 10,
        "useCallMonitor": true,
        "usePhonebook": true,
        "useDevices": true,
        "devices": [],
        "calllists": {
            "missed": {
                "generateJSON": true,
                "generateHTML": true,
                "maxEntries": 10
            },
            "all": {
                "generateJSON": true,
                "generateHTML": true,
                "maxEntries": 10
            },
            "inbound": {
                "generateJSON": true,
                "generateHTML": true,
                "maxEntries": 10
            },
            "outbound": {
                "generateJSON": true,
                "generateHTML": true,
                "maxEntries": 10
            }
        }
    },
    "objects": []
}